In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = Series(['one','two',np.nan,'three'])

In [3]:
data

0      one
1      two
2      NaN
3    three
dtype: object

In [4]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
data.isnull().sum()

1

In [6]:
data.dropna()

0      one
1      two
3    three
dtype: object

In [7]:
dframe= DataFrame([[1,2,3],[np.nan,4,5],[5,6,8]])

In [9]:
dframe

     0  1  2
0  1.0  2  3
1  NaN  4  5
2  5.0  6  8

In [10]:
dframe.dropna()

     0  1  2
0  1.0  2  3
2  5.0  6  8

In [11]:
dframe.dropna(axis=1)

   1  2
0  2  3
1  4  5
2  6  8

In [12]:
dframe= DataFrame([[1,2,3],[np.nan,4,5],[5,6,8],[np.nan,np.nan,np.nan]])

In [13]:
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  4.0  5.0
2  5.0  6.0  8.0
3  NaN  NaN  NaN

In [15]:
dframe.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  4.0  5.0
2  5.0  6.0  8.0

In [16]:
dframe.dropna(thresh=3)

     0    1    2
0  1.0  2.0  3.0
2  5.0  6.0  8.0

In [17]:
dframe.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  4.0  5.0
2  5.0  6.0  8.0
3  1.0  1.0  1.0

In [18]:
dframe.fillna({0:0,1:1,2:2,3:3})

     0    1    2
0  1.0  2.0  3.0
1  0.0  4.0  5.0
2  5.0  6.0  8.0
3  0.0  1.0  2.0

In [19]:
dframe.fillna(0,inplace=True)